*--------------------------------------------------------------------*
*    BMS MAPSET FOR REWARDS SYSTEM - VIEW POINTS
*--------------------------------------------------------------------*
RWDVIEW  DFHMSD TYPE=&SYSPARM,                                          *
               LANG=COBOL,                                             *
               MODE=INOUT,                                             *
               TERM=ALL,                                               *
               CTRL=FREEKB,                                            *
               STORAGE=AUTO,                                           *
               TIOAPFX=YES

RWDVWM1  DFHMDI SIZE=(24,80),                                           *
               LINE=1,                                                 *
               COLUMN=1

         DFHMDF POS=(01,32),LENGTH=19,INITIAL='VIEW REWARDS POINTS'

         DFHMDF POS=(04,02),LENGTH=13,INITIAL='Customer ID:'
CUSTID   DFHMDF POS=(04,17),LENGTH=9,ATTRB=(UNPROT,IC),PICIN='9(9)'

         DFHMDF POS=(07,02),LENGTH=12,INITIAL='Card Number:'
CARDNUM  DFHMDF POS=(07,16),LENGTH=16,ATTRB=ASKIP

         DFHMDF POS=(09,02),LENGTH=14,INITIAL='Points Balance:'
POINTS   DFHMDF POS=(09,18),LENGTH=13,ATTRB=ASKIP,PICOUT='ZZZ,ZZZ,ZZ9.99'

MSG1     DFHMDF POS=(23,02),LENGTH=80,ATTRB=ASKIP

         DFHMDF POS=(24,02),LENGTH=40,INITIAL='Press PF3 to return to the Main Menu.'

         DFHMSD TYPE=FINAL