//RWDRPTJ JOB 'Rewards Report',CLASS=A,MSGCLASS=0,NOTIFY=&SYSUID
//*-------------------------------------------------------------------
//*   JOB TO GENERATE A REWARDS ACTIVITY/STATEMENT REPORT.
//*
//*   STEP 1: SORT THE POINTS ACTIVITY FILE BY CUSTOMER ID.
//*   STEP 2: RUN THE REPORT PROGRAM AGAINST THE SORTED FILE.
//*-------------------------------------------------------------------
//SORT     EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DISP=SHR,DSN=AWS.M2.CARDDEMO.REWARDS.POINTS.PS
//SORTOUT  DD DSN=&&SORTED_POINTS,
//         DISP=(NEW,PASS,DELETE),
//         SPACE=(CYL,(1,1)),
//         DCB=(LRECL=126,RECFM=FB)
//SYSIN    DD *
  SORT FIELDS=(1,9,CH,A)
/*
//*-------------------------------------------------------------------
//REPORT   EXEC PGM=RWDRPT,REGION=0M
//STEPLIB  DD   DSN=AWS.M2.CARDDEMO.LOADLIB,DISP=SHR
//*
//* INPUT: REWARDS BALANCE AND *SORTED* POINT ACTIVITY FILES
//REWBALAN DD   DISP=SHR,DSN=AWS.M2.CARDDEMO.REWARDS.BALANCE.KSDS
//REWPOINT DD   DISP=SHR,DSN=&&SORTED_POINTS
//*
//* OUTPUT: THE CUSTOMER REWARDS STATEMENT REPORT
//RWDSTATM DD   DSN=AWS.M2.CARDDEMO.REWARDS.STMNT.PS,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(1,1)),
//             DCB=(LRECL=133,RECFM=FBA,BLKSIZE=0)
//*RWDSTATM DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSUDUMP DD   SYSOUT=*