 DELETE REWARDS.SYSTEM.RULES.VSAM.KSDS CLUSTER PURGE
 DELETE REWARDS.SYSTEM.BALANCE.VSAM.KSDS CLUSTER PURGE
 DELETE REWARDS.SYSTEM.POINTS.VSAM.KSDS CLUSTER PURGE
 SET MAXCC=0

 DEFINE CLUSTER (NAME(REWARDS.SYSTEM.RULES.VSAM.KSDS) -
    VOLUMES(M2VOL0) -
    INDEXED -
    KEYS(6 0) -
    RECSZ(80 80) -
    SHAREOPTIONS(2 3) -
    FREESPACE(10 10) ) -
    DATA (NAME(REWARDS.SYSTEM.RULES.VSAM.KSDS.DATA) -
    CISZ(4096) ) -
    INDEX (NAME(REWARDS.SYSTEM.RULES.VSAM.KSDS.INDEX) )

 DEFINE CLUSTER (NAME(REWARDS.SYSTEM.BALANCE.VSAM.KSDS) -
    VOLUMES(M2VOL0) -
    INDEXED -
    KEYS(9 0) -
    RECSZ(80 80) -
    SHAREOPTIONS(2 3) -
    FREESPACE(10 10) ) -
    DATA (NAME(REWARDS.SYSTEM.BALANCE.VSAM.KSDS.DATA) -
    CISZ(4096) ) -
    INDEX (NAME(REWARDS.SYSTEM.BALANCE.VSAM.KSDS.INDEX) )

 DEFINE CLUSTER (NAME(REWARDS.SYSTEM.POINTS.VSAM.KSDS) -
    VOLUMES(M2VOL0) -
    INDEXED -
    KEYS(25 0) -
    RECSZ(120 120) -
    SHAREOPTIONS(2 3) -
    FREESPACE(20 20) ) -
    DATA (NAME(REWARDS.SYSTEM.POINTS.VSAM.KSDS.DATA) -
    CISZ(4096) ) -
    INDEX (NAME(REWARDS.SYSTEM.POINTS.VSAM.KSDS.INDEX) )